openFoam/onrCht/combustorColdFlow/coarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}   
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (8.0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
		value			$internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            noSlip;
    }
    bottomWallInlet
    {
        type            noSlip;
    }
    bottomWall
    {
        type            noSlip;
    }
    frontAndBackWalls
    {
        type            noSlip;
    }
    stepHeight
    {
        type            noSlip;
    }
}

// ************************************************************************* //
