openFoam/onrCht/combustorColdFlow/coarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2.0;

deltaT          1e-6;

writeControl    runTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           1.0;

functions
{
	fieldAverage0
	{
		type            fieldAverage;
		libs            ( "libfieldFunctionObjects.so" );
		writeControl    writeTime;
		timeStart       1.0;
		timeEnd         2.0;

		fields
		(
			U
			{
				mean        on;
				prime2Mean  on;
				base        time;
			}

			p 
			{
				mean        on;
				prime2Mean  on;
				base        time;
			}
		);
	}
	fieldAverage1
	{
		type            fieldAverage;
		libs            ( "libfieldFunctionObjects.so" );
		writeControl    writeTime;
		timeStart       0.0;
		timeEnd         2.0;

		fields
		(
			U
			{
				mean        on;
				prime2Mean  on;
				base        time;
			}

			p 
			{
				mean        on;
				prime2Mean  on;
				base        time;
			}
		);
	}
}

// ************************************************************************* //
