openFoam/onrCht/combustorColdFlow/coarse/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG; // PCG;
		nCellsInCoarsestLevel 445;
        //preconditioner		DIC;
		mergeLevels			1;	
		smoother			GaussSeidel;
        tolerance			1e-9;
        relTol				0.01;
		minIter				3;
    }

    pFinal
    {
        $p;
        relTol				0.0;
    }

    "(U|e|h|k|nuTilda)"
    {
        solver				smoothSolver; //PBiCGStab;
		smoother			symGaussSeidel;
        //preconditioner  DILU;
        tolerance			1e-06;
        relTol				0.01;
    }

    "(U|h|k|nuTilda)Final"
    {
        //solver          PBiCGStab;
        //preconditioner  DILU;
        //tolerance       1e-06;
		$U;
        relTol          0;
    }

}

PIMPLE
{
	momentumPredictor	 yes;
    nOuterCorrectors	 1;
    nCorrectors			 2;
    nNonOrthogonalCorrectors 1;
    //pRefCell        1001;
    //pRefValue       0;
}

relaxationFactors
{
	equations
	{
		".*"	1;
	}
}

// ************************************************************************* //
